app/Controllers/AuthController.php

    public function login()
    {
        helper(['form']);

        if ($this->request->getMethod() == 'post') {
            $model = new UserModel();

            $user = $model->where('email', $this->request->getVar('email'))
                          ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'gabriel_cassano@hotmail.com'
 LIMIT 1