app/Libraries/MesRecettes.php

SELECT COUNT(*) AS `numrows`
FROM `recette`
SELECT `id`, `slug`, `titre`
FROM `recette`
ORDER BY `id`
 LIMIT 10
---
    public function getListeRecettes (array $rech)
    {
        // Obtenir seulement les champs id, slug et titre
        $this->recetteModel->select('id, slug, titre');

        // Si on recherche par texte, chercher dans le titre et les instructions
        if ( ! empty($rech['texte']))
        {
            $this->recetteModel
                ->like('titre', $rech['texte'])
                ->orLike('instructions', $rech['texte']);
        }

        // Si on ne demande pas un nombre de page spécifique, prendre la valeur par défaut
        $nb_par_page = ! empty($rech['nb_par_page']) ? $rech['nb_par_page'] : null;

        // Ajouter le tri et la pagination, puis retourner les résultats
        $recettes = $this->recetteModel
            ->orderBy('id')
            ->paginate($nb_par_page);